/*******************************************************************************
 *     File Name :                        activation.c
 *     Abstract Description :             激活函数计算方式
 *     todo :                             other activation function
 *                                        ...
 *******************************************************************************/

#include "activation.h"

/**********************************************************************************************
 * 判断输入参数是否在 enum 表中
 ***********************************************************************************************/
FLAG is_in_activation_tab(ACTIVATION activation) {
    FLAG flag = false;

    switch (activation) {
#define ACTIVATION_MACRO(a, b) case a:
        ACTIVATION_TAB
#undef ACTIVATION_MACRO

        flag = true;
        break;

    default:
        break;
    }

    return flag;
}

/**********************************************************************************************
Function: identity
Description: f(x) = x
Input: x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL identity(_IN REAL x) { return x; }

/**********************************************************************************************
Function: d_identity
Description: f'(x) = 1
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_identity(void) { return 1; }

/**********************************************************************************************
Function: sigmoid
Description: f(x) = 1 / (1 + e^(-x))
Input: x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL sigmoid(_IN REAL x) { return (1 / (1 + exp(-x))); }

/**********************************************************************************************
Function: d_sigmoid
Description: f'(x) = f(x)(1 - f(x)), f(x) = sigmoid(x)
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_sigmoid(_IN REAL x) {
    REAL y = sigmoid(x);
    return (y * (1 - y));
}

/**********************************************************************************************
Function: tanh
Description: f(x) = 2 / (1 + e^(-2x)) - 1 = 2sigmoid(2x) - 1
Input: x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL tanh(_IN REAL x) { return (2 * sigmoid(2 * x) - 1); }

/**********************************************************************************************
Function: d_tanh
Description: f'(x) = 1 - f(x)^2, f(x) = tanh(x)
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_tanh(_IN REAL x) {
    REAL y = tanh(x);
    return (1 - y * y);
}

/**********************************************************************************************
Function: relu
Description: f(x) = {0, x<0; x, x>=0}
Input: x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL relu(_IN REAL x) { return (x < 0 ? 0 : x); }

/**********************************************************************************************
Function: d_relu
Description: f'(x) = {0, x<0; 1, x>=0}
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_relu(_IN REAL x) { return (x < 0 ? 0 : 1); }

/**********************************************************************************************
Function: prelu
Description: f(x) = {ax, x<0; x, x>=0}
Input: a, x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL prelu(_IN REAL a, _IN REAL x) { return (x < 0 ? a * x : x); }

/**********************************************************************************************
Function: d_prelu
Description: f'(x) = {a, x<0; 1, x>=0}
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_prelu(_IN REAL a, _IN REAL x) { return (x < 0 ? a : 1); }

/**********************************************************************************************
Function: elu
Description: f(x) = {a(e^x - 1), x<0; x, x>=0}
Input: a, x
Output: 无
Input_Output: 无
Return: f(x)
***********************************************************************************************/
REAL elu(_IN REAL a, _IN REAL x) { return (x < 0 ? (a * (exp(x) - 1)) : x); }

/**********************************************************************************************
Function: d_elu
Description: f'(x) = {f(x)+a, x<0; 1, x>=0}, f(x) = elu(x)
Input: x
Output: 无
Input_Output: 无
Return: f'(x)
***********************************************************************************************/
REAL d_elu(_IN REAL a, _IN REAL x) { return (x < 0 ? (elu(a, x) + a) : 1); }